tap "databricks/tap"
brew "bash"
brew "btop"
brew "fzf"
brew "gh"
brew "git"
brew "kubernetes-cli"
brew "neofetch"
brew "neovim"
brew "nx"
brew "saml2aws"
brew "tmux"
brew "uv"
brew "databricks/tap/databricks"
cask "brave-browser"
cask "bruno"
cask "claude-code@latest"
cask "cursor"
cask "dbeaver-community"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-var"
cask "ghostty"
cask "jetbrains-toolbox"
cask "microsoft-office"
cask "notion"
cask "postman"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "janisdd.vscode-edit-csv"
vscode "markis.code-coverage"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "samuelcolvin.jinjahtml"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vintharas.learn-vim"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
uv "sqlfluff"
